Revit 2027 API
SpecTypeId.CostRateEnergy Property
 Cost Rate Energy, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CostRateEnergy { get; }
Public Shared ReadOnly Property CostRateEnergy As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CostRateEnergy {
	ForgeTypeId^ get ();
}
static member CostRateEnergy : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace